import { useEffect, useRef, useState } from "react";
import Dansers from "../assets/images/dancers.png";

export default function HistoryPage() {
  const timelineData = [
    {
      year: 1967,
      content: "Тарых",
      title: "Жалпы маалымат",
      text: "Бүбүсара Бейшеналиева атындагы Кыргыз мамлекеттик маданият жана искусство университети республиканын маданият жана искусство мекемелери үчүн жогорку квалификациялуу жана ар тараптуу билимдүү адистерди даярдоонун алдыңкы борборуна айланган республикадагы биринчи музыкалык-чыгармачылык окуу жайы. Кыргыз Республикасынын Юстиция министрлигинде катталган юридикалык жактын күбөлүгү (каттоо №13310-3301-У-е, ОКПО коду 02246840, сериясы 0065533 ГРП) бар. Мамлекеттик менчик, уюштуруу-укуктук формасы - мекеме, жайгашкан жери 720005 Бишкек ш., көч. Жантөшева 113.",
      img: Dansers,
    },
    {
      year: 1974,
      content: "Тарых",
      title: "1974-жылы окуу жайга кыргыздын чыгаан балеринасы, СССРдин эл артисти Б.Бейшеналиеванын ысымы ыйгарылган. Кыргыз мамлекеттик маданият жана искусство университетинин тарыхы 1967-жылы Кыргыз ССР Министрлер Советинин 1967-жылдын 12-августундагы No 482 токтому кабыл алынгандан башталат",
      text: "«Кыргыз мамлекеттик искусство институтун уюштуруу жөнүндө». Искусство институтунун ачылышында жана өнүгүшүнө көрүнүктүү мамлекеттик ишмер, республиканын экс-маданият министри Күлүйпа Кондучалованын ишмердүүлүгү чоң роль ойногон.СССРдин эл артисти Бүбүсара Бейшеналиева алдыңкы балетмейстерлердин галактикасынын бири. Анын чыгармачылыгы Кыргызстанда балет искусствосунун калыптануу тарыхын чагылдырат.Ал улуттук хореографиянын пайдубалын түптөгөн алгачкы бийчилерден болуп, өзүнүн ишмердүүлүгү менен кыргыз классикалык бийинин өнүгүшүн негизинен аныктаган.Бүбүсара Бейшеналиеванын өнөрүн жалпы эл тааныйт. Ага баруучу жол — кыргыз балетинин сахнасында жаралган эң сонун образдар, бир сөз менен айтканда, искусствонун эң коозуна — балет искусствосуна арналган бүткүл өмүрүн үзүрлүү, чымырканган эмгек жылдары.",
      img: Dansers,
    },
    {
      year: 1993,
      content: "Тарых",
      title: "1993-жыл университет үчүн бурулуш жыл болду.",
      text: "Университет Кыргызстандын маданият жана искусство чөйрөсү үчүн 5 миңден ашык жогорку квалификациялуу адистерди даярдаган.Алардын арасында СССРдин жана Кыргыз Республикасынын эл артисттери, СССРдин жана Кыргыз Республикасынын мамлекеттик сыйлыктарынын лауреаттары бар.Токтогул, ошондой эле республиканын эмгек сицирген искусство жана маданият ишмерлери катышышты.Кээ бир бүтүрүүчүлөр жогорку сыйлыктар менен сыйланган — алар Социалисттик Эмгектин Баатыры, «Манас» орденинин ээлери жана башкалар болушкан.Бүтүрүүчүлөрдүн арасында орто звенодогу жетекчилер бар, алар республиканын аймактарындагы маданият жана искусство мекемелеринин көпчүлүгүн жетектейт, ошондой эле республиканын театралдык жана оюн- зоок мекемелерин жетектейт.1993 - жылы университет үчүн бурулуш жыл болуп, эки окуу жайга – Кыргыз мамлекеттик искусство институтуна бөлүнгөн.Б.Бейшеналиева жана Кыргыз мамлекеттик консерваториясы, КМИИнин эки факультети уюшулган консерваториянын негизи болуп, институтта социалдык - маданий иш - чаралардын менеджери, фольклордук - этнографиялык ансамблдин жетекчиси сыяктуу жаңы факультеттер жана жаңы адистиктер пайда болду.Хореографиялык искусство бөлүмү ачылды.Институт драма жана кинематографиянын актёрлорун жана режиссёрлорун, кинорежиссёрлорду, кино экономисттерин, телевидение жана кинематографисттерди, үн инженерлерин, сценаристтерди, театр адистерин, андан кийин телерадио режиссерлорун чыгара баштады.",
      img: Dansers,
    },
    {
      title: "Б.Бейшеналиева атындагы Кыргыз мамлекеттик маданият жана искусство университети",
      text: "Окуу жайдын уюшулган алгачкы күндөрүнөн тартып кыргыз маданиятынын чолпон жылдыздары эмгектенди. Алардын айрымдарын атасак Кыргыз Республикасынын эл артисти, Токтогул атындагы Мамлекеттик  сыйлыктын лауреаты, профессор М.Абдраев, жеке ырчылык жана операны даярдоо кафедрасынын башчысы, СССРдин эл артисти, профессор С.Кийизбаева. Профессорлор Т.Б.Мусулманкулов, Кыргыз ССРинин эл артисти Н.Давлесов, Кыргыз Республикасынын эл артисти,Кыргыз Республикасынын эл артисти, СССР Мамлекеттик сыйлыгынын лауреаты Сарбагишев У.О., Кыргыз Республикасынын эл артисттери С.Юсупов, К.И.Алиев, Кыргыз Республикасынын Эл артисттери А.А.Асакеев, Т.М.Мураталиев, маданиятка эмгек сиңирген ишмерлер. Кыргыз Республикасынын эмгек сиңирген артисттери О.Абдылдаев, А.Укурчинов, Б.Мамбеталиев, режиссёрлор Ж.Молдобаев, Э.Токтогулов, Ж.Абдылдаев өңдүү мыктылар окуу жайдын пайдубалы түптөлүп, андан ары ишмердүүлүгүн улантып кетүүсүнө зор салым кошкон.Кыргыз Республикасынын Өкмөтүнүн 2013-жылдын 28-августундагы № 470 токтому менен билим берүү мекемесинин материалдык-техникалык базасын мындан ары чыңдоо, маданият, искусство, кинематография, маалымат мекемелери үчүн адистерди даярдоонун сапатын жогорулатуу максатында , . Б.Бейшеналиева атындагы Кыргыз мамлекеттик искусство институту Кыргыз мамлекеттик маданият жана искусство университети болуп өзгөртүлгөн",
      img: Dansers,
    },
    {
      year: 2025,
      content: "УЛУТТУК СТАТУС ЫЙГАРЫЛДЫ",
      title: "Кыргыз Республикасынын Президенти С.Н.Жапаровдун 2025-жылдын 22-мартындагы N96 Жарлыгына ылайык Б.Бейшеналиева атындагы КММИУга Улуттук статус ыйгарылды. Мындан ары, Б.Бейшеналиева атындагы Кыргыз Улуттук маданият жана искусство университети.",
      text: "Бүбүсара Бейшеналиева атындагы Кыргыз мамлекеттик маданият жана искусство университетине “улуттук” деген статусту ыйгаруу жөнүндө Маданият жана искусство жаатындагы жогорку кесиптик билим берүүнү өнүктүрүүгө жана өркүндөтүүгө кошкон олуттуу салымы үчүн, Кыргыз Республикасынын Конституциясынын 71-беренесин жетекчиликке алып, токтом кылам: 1. Бүбүсара Бейшеналиева атындагы Кыргыз мамлекеттик маданият жана искусство университетине “улуттук” деген статус ыйгарылсын жана мындан ары “Бүбүсара Бейшеналиева атындагы Кыргыз улуттук маданият жана искусство университети” деп аталсын. 2. Кыргыз Республикасынын Министрлер Кабинети өзүнүн чечимдерин ушул Жарлыкка ылайык келтирсин. 3. Бул Жарлыктын аткарылышын контролдоо Кыргыз Республикасынын Президентинин Администрациясынын Президенттин жана Министрлер Кабинетинин чечимдерин аткарууну контролдоо башкармалыгына жүктөлсүн. 4. Бул Жарлык расмий жарыяланган күндөн тартып жети күн өткөндөн кийин күчүнө кирет.",
      img: Dansers,
    },
  ];

  const refs = useRef([]);
  const [activeIndex, setActiveIndex] = useState(0);

  useEffect(() => {
    const options = { threshold: 0.25 };

    const observer = new IntersectionObserver((entries) => {
      entries.forEach((entry) => {
        if (entry.isIntersecting) {
          const index = Number(entry.target.dataset.index);
          setActiveIndex(index);
        }
      });
    }, options);

    refs.current.forEach((ref) => ref && observer.observe(ref));
    return () => observer.disconnect();
  }, []);

  return (
    <div className="relative mx-auto pt-24 md:pt-48 mr-3">

      <h1 className="font-serif text-center text-3xl md:text-6xl font-bold mb-16 md:mb-24 text-[#751715] italic">
        ТАРЫХ
      </h1>
      <div className="hidden md:block absolute left-1/2 top-96 bottom-0 w-[3px] bg-gray-300 -translate-x-1/2 z-0"></div>

      {timelineData.map((item, index) => {
        const isActive = index === activeIndex;
        const isLeft = index % 2 === 0;

        return (
          <div
            key={index}
            data-index={index}
            ref={(el) => (refs.current[index] = el)}
            className="relative py-16 md:py-32"
          >
            <div className="absolute left-1/2 top-0 -translate-x-1/2 z-20 transition-all duration-300">
              <div
                className={`flex items-center justify-center rounded-full transition-all duration-300 ${isActive
                    ? "w-16 h-8 border border-[#751715] text-sm font-semibold"
                    : "w-6 h-6 border border-button-primary flex items-center justify-center rounded-full"
                  }`}
              >
                {!isActive && <div className="w-4 h-4 bg-button-primary rounded-full"></div>}
                {isActive && item.year}
              </div>
            </div>

            <div
              className={`flex flex-col md:flex-row gap-6 md:gap-10 items-center transition-all duration-500 ${isLeft ? "md:flex-row" : "md:flex-row-reverse"
                }`}
              style={{
                transform: isActive
                  ? "translateY(-10px)"
                  : "translateY(0)",
              }}
            >
              <div
                className="w-full md:w-1/2 px-8 transition-all duration-500"
                style={{
                  transform: isActive ? "translateY(-10px)" : "translateY(0)",
                  opacity: isActive ? 1 : 0.8,
                }}
              >
                <p className="font-sans text-gray-700 leading-relaxed text-sm md:text-base border rounded p-4 md:p-5">
                <h3 className="text-lg md:text-xl text-primary-text font-semibold mb-2">{item.title}</h3>
                  {item.text}
                </p>
              </div>

              <div
                className="w-full md:w-1/2 transition-all duration-500"
                style={{
                  transform: isActive ? "translateY(-20px) scale(1.02)" : "translateY(0) scale(1)",
                }}
              >
                <img src={item.img} className="w-full h-[300px] md:h-[500px] object-cover rounded" />
              </div>
            </div>
          </div>
        );
      })}
    </div>

  );
}
